#+title: QMK Configuration and Layout for SplitShift
#+author: Biruh Tesfahun

SplitShift is a custom split keyboard based on the Corne desgin with 3x5_3 layout.

**** build it



#+BEGIN_SRC shell :results output :shebang #!/usr/bin/env bash
~/.local/bin/qmk clean
~/.local/bin/qmk compile -kb splitshift -km default
#+END_SRC

#+RESULTS:
#+begin_example
QMK Firmware 0.26.8
Deleting .build/ ... done.


Generating: .build/obj_splitshift_default/src/info_deps.d                                           [32;01m[OK][0m
Generating: .build/obj_splitshift_default/src/default_keyboard.c                                    [32;01m[OK][0m
avr-gcc (GCC) 8.3.0
Copyright (C) 2018 Free Software Foundation, Inc.
This is free software; see the source for copying conditions.  There is NO
warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.

Generating: .build/obj_splitshift_default/src/info_config.h                                         [32;01m[OK][0m
Generating: .build/obj_splitshift_default/src/default_keyboard.h                                    [32;01m[OK][0m
Compiling: .build/obj_splitshift_default/src/default_keyboard.c                                     [32;01m[OK][0m
Compiling: quantum/keymap_introspection.c                                                           [32;01m[OK][0m
Compiling: quantum/quantum.c                                                                        [32;01m[OK][0m
Compiling: quantum/bitwise.c                                                                        [32;01m[OK][0m
Compiling: quantum/led.c                                                                            [32;01m[OK][0m
Compiling: quantum/action.c                                                                         [32;01m[OK][0m
Compiling: quantum/action_layer.c                                                                   [32;01m[OK][0m
Compiling: quantum/action_tapping.c                                                                 [32;01m[OK][0m
Compiling: quantum/action_util.c                                                                    [32;01m[OK][0m
Compiling: quantum/eeconfig.c                                                                       [32;01m[OK][0m
Compiling: quantum/keyboard.c                                                                       [32;01m[OK][0m
Compiling: quantum/keymap_common.c                                                                  [32;01m[OK][0m
Compiling: quantum/keycode_config.c                                                                 [32;01m[OK][0m
Compiling: quantum/sync_timer.c                                                                     [32;01m[OK][0m
Compiling: quantum/logging/debug.c                                                                  [32;01m[OK][0m
Compiling: quantum/logging/sendchar.c                                                               [32;01m[OK][0m
Compiling: quantum/matrix_common.c                                                                  [32;01m[OK][0m
Compiling: quantum/matrix.c                                                                         [32;01m[OK][0m
Compiling: quantum/debounce/sym_defer_g.c                                                           [32;01m[OK][0m
Compiling: quantum/split_common/split_util.c                                                        [32;01m[OK][0m
Compiling: quantum/split_common/transport.c                                                         [32;01m[OK][0m
Compiling: quantum/split_common/transactions.c                                                      [32;01m[OK][0m
Compiling: quantum/main.c                                                                           [32;01m[OK][0m
Assembling: platforms/avr/xprintf.S                                                                 [32;01m[OK][0m
Compiling: platforms/avr/printf.c                                                                   [32;01m[OK][0m
Compiling: quantum/bootmagic/bootmagic.c                                                            [32;01m[OK][0m
Compiling: quantum/crc.c                                                                            [32;01m[OK][0m
Compiling: quantum/process_keycode/process_grave_esc.c                                              [32;01m[OK][0m
Compiling: quantum/process_keycode/process_magic.c                                                  [32;01m[OK][0m
Compiling: quantum/mousekey.c                                                                       [32;01m[OK][0m
Compiling: quantum/send_string/send_string.c                                                        [32;01m[OK][0m
Compiling: quantum/process_keycode/process_space_cadet.c                                            [32;01m[OK][0m
Compiling: tmk_core/protocol/host.c                                                                 [32;01m[OK][0m
Compiling: tmk_core/protocol/report.c                                                               [32;01m[OK][0m
Compiling: tmk_core/protocol/usb_device_state.c                                                     [32;01m[OK][0m
Compiling: tmk_core/protocol/usb_util.c                                                             [32;01m[OK][0m
Compiling: platforms/suspend.c                                                                      [32;01m[OK][0m
Compiling: platforms/synchronization_util.c                                                         [32;01m[OK][0m
Compiling: platforms/timer.c                                                                        [32;01m[OK][0m
Compiling: platforms/avr/hardware_id.c                                                              [32;01m[OK][0m
Compiling: platforms/avr/platform.c                                                                 [32;01m[OK][0m
Compiling: platforms/avr/suspend.c                                                                  [32;01m[OK][0m
Compiling: platforms/avr/timer.c                                                                    [32;01m[OK][0m
Compiling: platforms/avr/bootloaders/dfu.c                                                          [32;01m[OK][0m
Compiling: platforms/avr/drivers/i2c_master.c                                                       [32;01m[OK][0m
Archiving: .build/obj_splitshift_default/i2c_master.o                                               [32;01m[OK][0m
Compiling: platforms/avr/drivers/i2c_slave.c                                                        [32;01m[OK][0m
Archiving: .build/obj_splitshift_default/i2c_slave.o                                                [32;01m[OK][0m
Compiling: platforms/avr/drivers/serial.c                                                           [32;01m[OK][0m
Archiving: .build/obj_splitshift_default/serial.o                                                   [32;01m[OK][0m
Compiling: tmk_core/protocol/lufa/lufa.c                                                            [32;01m[OK][0m
Compiling: tmk_core/protocol/usb_descriptor.c                                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Class/Common/HIDParser.c                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Device_AVR8.c                                        [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/EndpointStream_AVR8.c                                [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Endpoint_AVR8.c                                      [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Host_AVR8.c                                          [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/PipeStream_AVR8.c                                    [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Pipe_AVR8.c                                          [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/USBController_AVR8.c                                 [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/USBInterrupt_AVR8.c                                  [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/ConfigDescriptors.c                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/DeviceStandardReq.c                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/Events.c                                                  [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/HostStandardReq.c                                         [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/USBTask.c                                                 [32;01m[OK][0m
Compiling: tmk_core/protocol/lufa/usb_util.c                                                        [32;01m[OK][0m
Linking: .build/splitshift_default.elf                                                              [32;01m[OK][0m
Creating load file for flashing: .build/splitshift_default.hex                                      [32;01m[OK][0m
Copying splitshift_default.hex to qmk_firmware folder                                               [32;01m[OK][0m
Checking file size of splitshift_default.hex                                                        [32;01m[OK][0m
 ,* The firmware size is fine - 16016/28672 (55%, 12656 bytes free)
#+end_example

